#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-terraform-aws-projects-2025/AWS-Image-Labels-Generator/runs/run-KY4SEiU9cwKPPudL

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=df8fe8692dc0f9dedc05c551918f199af644efa5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.lambda_log_group will be created
  + resource "aws_cloudwatch_log_group" "lambda_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/rekognition-image-labels-rekognition-lambda"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "rekognition-image-labels-lambda-log-group"
        }
      + tags_all          = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "rekognition-image-labels-lambda-log-group"
          + "Owner"       = "ShenLoong"
          + "Project"     = "rekognition-image-labels"
        }
    }

  # aws_iam_policy.rekognition_policy will be created
  + resource "aws_iam_policy" "rekognition_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow Rekognition label detection"
      + id               = (known after apply)
      + name             = "rekognition-image-labels-rekognition-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "rekognition:DetectLabels",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "rekognition-image-labels-rekognition-policy"
        }
      + tags_all         = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "rekognition-image-labels-rekognition-policy"
          + "Owner"       = "ShenLoong"
          + "Project"     = "rekognition-image-labels"
        }
    }

  # aws_iam_policy.rekognition_s3_policy will be created
  + resource "aws_iam_policy" "rekognition_s3_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Read-only access to the images bucket"
      + id               = (known after apply)
      + name             = "rekognition-image-labels-s3-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "rekognition-image-labels-s3-policy"
        }
      + tags_all         = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "rekognition-image-labels-s3-policy"
          + "Owner"       = "ShenLoong"
          + "Project"     = "rekognition-image-labels"
        }
    }

  # aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "rekognition-image-labels-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "rekognition-image-labels-lambda-role"
        }
      + tags_all              = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "rekognition-image-labels-lambda-role"
          + "Owner"       = "ShenLoong"
          + "Project"     = "rekognition-image-labels"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_attach_rekognition will be created
  + resource "aws_iam_role_policy_attachment" "lambda_attach_rekognition" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "rekognition-image-labels-lambda-role"
    }

  # aws_iam_role_policy_attachment.lambda_attach_s3 will be created
  + resource "aws_iam_role_policy_attachment" "lambda_attach_s3" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "rekognition-image-labels-lambda-role"
    }

  # aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "rekognition-image-labels-lambda-role"
    }

  # aws_lambda_function.rekognition_lambda will be created
  + resource "aws_lambda_function" "rekognition_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "lambda/function.zip"
      + function_name                  = "rekognition-image-labels-rekognition-lambda"
      + handler                        = "detect_labels.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "ExqG7jT7Ug2upuxhmX6VVGj6+4k9JJieD22SV6UGt8E="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "rekognition-image-labels"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # aws_lambda_permission.allow_s3 will be created
  + resource "aws_lambda_permission" "allow_s3" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "rekognition-image-labels-rekognition-lambda"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromS3Bucket"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket.images_bucket will be created
  + resource "aws_s3_bucket" "images_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "rekognition-image-labels"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.images_bucket_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "images_bucket_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "cleanup-old-files"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = false
            }

          + filter {
                # (1 unchanged attribute hidden)
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 7
            }
        }
    }

  # aws_s3_bucket_notification.bucket_notification will be created
  + resource "aws_s3_bucket_notification" "bucket_notification" {
      + bucket      = (known after apply)
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.images_bucket_access will be created
  + resource "aws_s3_bucket_public_access_block" "images_bucket_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.sse will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "sse" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_versioning.versioning_images_bucket will be created
  + resource "aws_s3_bucket_versioning" "versioning_images_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # random_id.bucket_id will be created
  + resource "random_id" "bucket_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_region                = "ap-southeast-1"
  + lambda_execution_role_arn = (known after apply)
  + lambda_function_name      = "rekognition-image-labels-rekognition-lambda"
  + lambda_role_name          = "rekognition-image-labels-lambda-role"
  + s3_bucket_name            = (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 3 estimated
           $0.0/mo +$0.0

```

</details>